/*******************************************************************************
* タイトル:		タイトル
* プログラム名:	player.cpp
* 作成者:		GP11B132 16 竹内大翔
* 作成日:		2022/06/25
*******************************************************************************/

/*******************************************************************************
* scanf のwarning防止
*******************************************************************************/
#define _CRT_SECURE_NO_WARNINGS

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "title.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/


/*******************************************************************************
* グローバル変数
*******************************************************************************/
short g_title[DISP_H][DISP_W];
char g_title_char[DISP_H][DISP_W];
//                          0    1    2    3    4    5    6    7    8 
char g_title_mark[][10] = { "  ","■","◆","□","--","◆","◇","▲"," │"};
char g_title_text[][10] = { "  ","０","１","２","３","点","←","ゲ","ー","ム","オ","ー","バ","ー","ラ","イ","ン","自","機","移","動","WS","攻","撃","sp ","ac","e ","：", "イ","ン","ベ","ー","ダ","ー","ゲ","ー","ム","が","作","り","た","か","っ","た"};
/*******************************************************************************
* void title_Init(void)
* draw_titleの初期化
* g_titleを０で埋める
*******************************************************************************/
void title_Init(void) {
	for (int i = 0; i <= DISP_H; i++) {
		for (int j = 0; j < DISP_W / 2; j++) {
			g_title[i][j] = 0;//空白
			if (j == 5) {
				g_title[i][j] = 8;//ゲームオーバーライン
			}
		}
	}

	//サンプルの表示
	//良い書き方が思い浮かばない
	int y = 2;


	short title_text_tile0[11] = { -6,-7,-8,-9,-10,-11,-12,-13,-14,-15,-16 };
	for (int i = 0; i < 11; i++) {
		g_title[y][7 + i] = title_text_tile0[i];
	}
	//プレイヤーの操作
	y++;
	y++;

	short title_text_text[4] = { -19,-20,-27,-21 };
	for (int i = 0; i < 4; i++) {
		g_title[y][10 + i] = title_text_text[i];
	}
	y++;
	short title_text_text1[10] = { -22,-23,-27,-24,-25,-26 };
	for (int i = 0; i < 10; i++) {
		g_title[y][10 + i] = title_text_text1[i];
	}
	y++;
	y++;


	//自機
	g_title[y][10] = 1;
	y++;
	g_title[y][11] = 1;
	g_title[y][10] = 1;
	short title_text_tile1[10] =  {-6, -17, -18};
	for (int i = 0; i < 10; i++) {
		g_title[y][12 + i] = title_text_tile1[i];
	}
	y++;
	g_title[y][10] = 1;
	y++;
	y++;

	//エネミー１
	g_title[y][11] = 5;
	y++;
	g_title[y][11] = 5;
	g_title[y][10] = 5;
	short title_text_tile2[10] = { -6,-4,-1,-1,-5 };
	for (int i = 0; i < 10;i++) {
		g_title[y][12+i] = title_text_tile2[i];
	}
	y++;
	g_title[y][11] = 5;
	y++;
	y++;


	//エネミー２
	g_title[y][11] = 6;
	y++;
	g_title[y][11] = 6;
	g_title[y][10] = 6;
	short title_text_tile3[10] = { -6,-3,-1,-1,-5 };
	for (int i = 0; i < 10; i++) {
		g_title[y][12 + i] = title_text_tile3[i];
	}
	y++;
	g_title[y][11] = 6;
	y++;
	y++;
	//エネミー３
	g_title[y][11] = 7;
	y++;
	g_title[y][11] = 7;
	g_title[y][10] = 7;
	short title_text_tile4[10] = { -6,-2,-1,-1,-5 };
	for (int i = 0; i < 10; i++) {
		g_title[y][12 + i] = title_text_tile4[i];
	}
	y++;
	g_title[y][11] = 7;
	y++;


	short title_text_tile[] = { -28,-29,-30,-31,-32,-33,-34,-35,-36,-37,-38,-39,-40,-41,-42,-43};
	for (int i = 0; i < 9; i++) {
		g_title[10][25 + i] = title_text_tile[i];
	}
	for (int i = 0; i < 7; i++) {
		g_title[11][26 + i] = title_text_tile[i+9];
	}
}

void title_Uninit(void) {
}
void title_Update(void) {


	if (_kbhit() == 0) { // Key入力がない？
	// Key入力がないからここでリターンする
		Sleep(1);
		return;
	}
	int key=_getch();
	SetMode(GAME_MODE);
}
void title_Draw(void) {
	//g_titleをg_title_markに合わせてg_titile_charに変換
	for (int i = 0; i < DISP_H; i++) {
		for (int j = 0; j < DISP_W / 2; j++) {
			if (g_title[i][j] >= 0) {//普通のマスク
				strcpy(&g_title_char[i][j * 2], g_title_mark[g_title[i][j]]);
			}
			else {
				strcpy(&g_title_char[i][j * 2], g_title_text[-1*g_title[i][j]]);
			}
		}
	}
	system("cls");
	printf("\n%s", &g_title_char);
}
